#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-07a6633ac89fca665]
module.databases.aws_dynamodb_table.customer_db: Refreshing state... [id=customers_cache]
module.s3.aws_s3_bucket.lambda_s3: Refreshing state... [id=tech-challenge-soat1-grp13-s3-auth]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-0e44fb252e440a901]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0cc777a5f31d60b1f]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-0b721a917a8ffdaf7]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-08c0895a9c84870c9]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-035c763221994439a]
module.databases.aws_security_group.rds-postgres-sg: Refreshing state... [id=sg-0e34013d49d4bfe0a]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0d89c495096f32d30]
module.networking.aws_security_group.tech_challenge_sg: Refreshing state... [id=sg-05de5ebc37532145e]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-03b0e9447f0dd633d]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0cc777a5f31d60b1f1080289494]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0abbf939d7f2dc9c2]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-014d9e6586b1da48a]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00393fcd869ccc823]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-046e95e3ef22edc93]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databases.aws_db_instance.postgresql_db will be created
  + resource "aws_db_instance" "postgresql_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = "us-west-2a"
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "TechChallenge"
      + db_subnet_group_name                  = "db_subnet_group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "techchallenge"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Environment" = "dev"
          + "Name"        = "RDS"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "Name"        = "RDS"
        }
      + timezone                              = (known after apply)
      + username                              = "fiap"
      + vpc_security_group_ids                = [
          + "sg-0e34013d49d4bfe0a",
        ]
    }

  # module.networking.aws_db_subnet_group.db_subnet will be created
  + resource "aws_db_subnet_group" "db_subnet" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "db_subnet_group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-03b0e9447f0dd633d",
          + "subnet-0d89c495096f32d30",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "Name"        = "dev-db_subnet_group"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "Name"        = "dev-db_subnet_group"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @luiz-soh, Action: `pull_request`*